src/CF/DataProcessors/КонсольЗапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>КонсольЗапросов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьАвтосохранение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодАвтосохранения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФормам</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>700</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступныеТипыДанных</Name>
					<Type>
						<v8:Type>v8:TypeDescription</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Имя файла XML, где хранятся запросы и параметры.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВРезультатахЗапросаЗначенияСсылок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбхода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧередованиеЦветовВРезультатеЗапроса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыполнения</Name>
							<Comment>Время выполнения в секундах</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСтрок</Name>
							<Comment>Количество возвращаемых строк в результате запроса</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресРезультата</Name>
							<Comment>Адрес временного хранилища, где хранится результат</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресРезультатовЗапроса</Name>
							<Comment>Адрес массива результов запроса во временном  хранилище</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторЗапроса</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/CF/DataProcessors/КонсольЗапросов/Ext/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ РАБОТЫ С ВРЕМЕННЫМ ХРАНИЛИЩЕМ

// Помещает во внутреннее хранилище Запросы, Параметры, Имя файла.
//
// Параметры:
//	Объект - передаваемый объект обработки.
//	ИдентификаторТекущегоЗапроса - GUID текущего запроса.
//  ИдентификаторТекущегоПараметра - GUID текущего параметра.
//
Функция ПоместитьЗапросыВоВременноеХранилище(Объект, ИдентификаторТекущегоЗапроса, ИдентификаторТекущегоПараметра) Экспорт
	ПараметрыПередачи = Новый Структура;
	ПараметрыПередачи.Вставить("Запросы", Объект.Запросы.Выгрузить());	
	ПараметрыПередачи.Вставить("Параметры", Объект.Параметры.Выгрузить());
	ПараметрыПередачи.Вставить("ИмяФайла", Объект.ИмяФайла);
	ПараметрыПередачи.Вставить("ИдентификаторТекущегоЗапроса", ИдентификаторТекущегоЗапроса);
	ПараметрыПередачи.Вставить("ИдентификаторТекущегоПараметра", ИдентификаторТекущегоПараметра);
    
	АдресХранилища = ПоместитьВоВременноеХранилище(ПараметрыПередачи);
	Возврат АдресХранилища;
КонецФункции

// Помещает во внутренне хранилище настройки обработки.
// 
// Параметры:
// 	Объект - передаваемый Объект обработки.
//
Функция ПоместитьНастройкиВоВременноеХранилище(Объект) Экспорт
	ПараметрыПередачи = Новый Структура;
	ПараметрыПередачи.Вставить("ИспользоватьАвтосохранение", Объект.ИспользоватьАвтосохранение);	
	ПараметрыПередачи.Вставить("ПериодАвтосохранения", Объект.ПериодАвтосохранения);
	ПараметрыПередачи.Вставить("ВыводитьВРезультатахЗапросаЗначенияСсылок", Объект.ВыводитьВРезультатахЗапросаЗначенияСсылок);
	ПараметрыПередачи.Вставить("ЧередованиеЦветовВРезультатеЗапроса", Объект.ЧередованиеЦветовВРезультатеЗапроса);
	ПараметрыПередачи.Вставить("ТипОбхода", Объект.ТипОбхода);
	
	АдресХранилища = ПоместитьВоВременноеХранилище(ПараметрыПередачи);
	Возврат АдресХранилища;
КонецФункции



///////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ РАБОТЫ С XML-ФАЙЛАМИ

// Записывает Запросы(текст и параметры запроса) в файл XML.
//
// Параметры:
//	ИмяФайла - имя файла XML.
//	Объект - передаваемый объект обработки.
//
Функция ЗаписатьЗапросыВФайлXML(знач Объект) Экспорт
	
	ФайлXML = Новый ЗаписьXML;
	ИмяФайла = ПолучитьИмяВременногоФайла("q1c");
	ФайлXML.ОткрытьФайл(ИмяФайла);
	ФайлXML.ЗаписатьОбъявлениеXML();
	ФайлXML.ЗаписатьНачалоЭлемента("querylist");
	// Цикл запросов.
	Для каждого ТекЗапрос из Объект.Запросы цикл
		ФайлXML.ЗаписатьНачалоЭлемента("query");
		ФайлXML.ЗаписатьАтрибут("name", ТекЗапрос.Имя);
			ФайлXML.ЗаписатьНачалоЭлемента("text");
			ТекстЗапроса = ТекЗапрос.Текст;
			Для Счетчик = 1 По СтрЧислоСтрок(ТекстЗапроса) Цикл
				ПереносСтр	= Символы.ВК + Символы.ПС;
				ТекСтрока 	= СтрПолучитьСтроку(ТекстЗапроса, Счетчик);
				ФайлXML.ЗаписатьТекст(ТекСтрока);
				ФайлXML.ЗаписатьБезОбработки(ПереносСтр);
			КонецЦикла;
			ФайлXML.ЗаписатьКонецЭлемента();
			ИдентификаторЗапроса = ТекЗапрос.Идентификатор;
			// Запись параметров в XML-файл.
			Если Объект.Параметры.Количество() > 0 Тогда 
				ФайлXML.ЗаписатьНачалоЭлемента("parameters");
				Для каждого ТекПараметр из Объект.Параметры Цикл 
					Если ТекПараметр.ИдентификаторЗапроса = ИдентификаторЗапроса Тогда 
						ИмяПараметра		= ТекПараметр.Имя;
						ТипПараметра		= ТекПараметр.Тип;
						Значение			= ТекПараметр.Значение;
						Если ПустаяСтрока(Значение) тогда
							ЗначениеПараметра = ""; 
						Иначе
							ЗначениеПараметра = ЗначениеИзСтрокиВнутр(ТекПараметр.Значение);
						КонецЕсли;	
						
						ФайлXML.ЗаписатьНачалоЭлемента("parameter");
						ФайлXML.ЗаписатьАтрибут("name", ИмяПараметра);
						Если ТипПараметра = "СписокЗначений" Тогда 
							ФайлXML.ЗаписатьАтрибут("type", ТипПараметра);
							ЗаписатьСписокЗначенийВXML(ФайлXML, ЗначениеПараметра);
						ИначеЕсли ТипПараметра = "ТаблицаЗначений" Тогда
							ФайлXML.ЗаписатьАтрибут("type", ТипПараметра);
							
							Попытка
								Колонки = ЗначениеПараметра.Колонки.Количество();
							Исключение
								Колонки = 0;
							КонецПопытки;
							
							Попытка
								Строки = ЗначениеПараметра.Количество();
							Исключение
								Строки = 0;
							КонецПопытки;	
							
							ФайлXML.ЗаписатьАтрибут("colcount", XMLСтрока(Колонки));
							ФайлXML.ЗаписатьАтрибут("rowcount", XMLСтрока(Строки));
							
							ЗаписатьТаблицуЗначенийВXML(ФайлXML, ЗначениеПараметра);
						ИначеЕсли ТипПараметра = "МоментВремени" Тогда
							ФайлXML.ЗаписатьАтрибут("type", ТипПараметра);
							ЗаписатьМоментВремениВXML(ФайлXML, ЗначениеПараметра);
						ИначеЕсли ТипПараметра = "Граница" Тогда
							ФайлXML.ЗаписатьАтрибут("type", ТипПараметра);
							ЗаписатьГраницуВXML(ФайлXML, ЗначениеПараметра);
						Иначе
							ИмяТипа = ИмяТипаИзЗначения(ЗначениеПараметра); 
							ФайлXML.ЗаписатьАтрибут("type", ИмяТипа);
							ФайлXML.ЗаписатьАтрибут("value", XMLСтрока(ЗначениеПараметра));
						КонецЕсли;	
						ФайлXML.ЗаписатьКонецЭлемента();
					КонецЕсли;	
				КонецЦикла;	
				ФайлXML.ЗаписатьКонецЭлемента();
			КонецЕсли;	
		ФайлXML.ЗаписатьКонецЭлемента();
	КонецЦикла;	
	ФайлXML.ЗаписатьКонецЭлемента();
	ФайлXML.Закрыть();
	
	ВозвращаемоеЗначение = Новый ДвоичныеДанные(ИмяФайла);
	
	УдалитьФайлы(ИмяФайла);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Записывает строки списка значений в Файл XML.
//
// Параметры:
//	ФайлXML - записьXML.
//	Значение - список значений.
//
Процедура ЗаписатьСписокЗначенийВXML(ФайлXML, Значение)
	Если ТипЗнч(Значение) <> Тип("СписокЗначений") Тогда 
		Возврат;
	КонецЕсли;	
	
	Для каждого СтрСписка из Значение Цикл
		ЗначениеЭлементаСписка	= СтрСписка.Значение;
		// Определение имени типа.
		ИмяТипа = ИмяТипаИзЗначения(ЗначениеЭлементаСписка); 
		
		ФайлXML.ЗаписатьНачалоЭлемента("item");
			ФайлXML.ЗаписатьАтрибут("type", ИмяТипа);
			ФайлXML.ЗаписатьАтрибут("value", XMLСтрока(ЗначениеЭлементаСписка));
		ФайлXML.ЗаписатьКонецЭлемента();
	КонецЦикла;	
КонецПроцедуры	

// Записывает ячейки таблицы значений в Файл XML.
//
// Параметры:
//	ФайлXML - записьXML.
//	Значение - таблица значений.
//
Процедура ЗаписатьТаблицуЗначенийВXML(ФайлXML, Значение)
	Если ТипЗнч(Значение) <> Тип("ТаблицаЗначений") Тогда 
		Возврат;
	КонецЕсли;	
	
	КолКолонок 	= Значение.Колонки.Количество();
	КолСтрок	= Значение.Количество();
	
	Для СтрокаИндекс = 0 по КолСтрок - 1 Цикл
		Для КолонкаИндекс = 0 по КолКолонок - 1 Цикл 
			ЗначениеЭлементаСписка	= Значение.Получить(СтрокаИндекс).Получить(КолонкаИндекс);
			ИмяКолонки = Значение.Колонки.Получить(КолонкаИндекс).Имя;
			// Определение имени типа.
			ИмяТипа = ИмяТипаИзЗначения(ЗначениеЭлементаСписка); 
			
			ФайлXML.ЗаписатьНачалоЭлемента("item");
				ФайлXML.ЗаписатьАтрибут("nameCol", ИмяКолонки);
				ФайлXML.ЗаписатьАтрибут("row", XMLСтрока(СтрокаИндекс));
				ФайлXML.ЗаписатьАтрибут("col", XMLСтрока(КолонкаИндекс));
				ФайлXML.ЗаписатьАтрибут("type", ИмяТипа);
				ФайлXML.ЗаписатьАтрибут("value", XMLСтрока(ЗначениеЭлементаСписка));
			ФайлXML.ЗаписатьКонецЭлемента();
		КонецЦикла;
	КонецЦикла;	
КонецПроцедуры	

// Записывает момент времени в Файл XML.
//
// Параметры:
//	ФайлXML - записьXML.
//	Значение - момент времени.
//
Процедура ЗаписатьМоментВремениВXML(ФайлXML, Значение)
	Если ТипЗнч(Значение) <> Тип("МоментВремени") Тогда 
		Возврат;
	КонецЕсли;	
	
	// Определение имени типа.
	ИмяТипа = ИмяТипаИзЗначения(Значение.Ссылка); 
	
	ФайлXML.ЗаписатьНачалоЭлемента("item");
		Если Значение.Ссылка <> Неопределено Тогда 
			ФайлXML.ЗаписатьАтрибут("type", ИмяТипа);
			ФайлXML.ЗаписатьАтрибут("valueRef", XMLСтрока(Значение.Ссылка));
		КонецЕсли;	
		ФайлXML.ЗаписатьАтрибут("valueDate", XMLСтрока(Значение.Дата));
	ФайлXML.ЗаписатьКонецЭлемента();
КонецПроцедуры	

// Записывает границу.
//
Процедура ЗаписатьГраницуВXML(ФайлXML, Граница)
	Если ТипЗнч(Граница) <> Тип("Граница") Тогда 
		Возврат;
	КонецЕсли;	
	
	ФайлXML.ЗаписатьНачалоЭлемента("divide");
		// Определение имени типа.
		ИмяТипа 			= ИмяТипаИзЗначения(Граница.Значение); 
		ТипЗначенияГраницы 	= ТипЗнч(Граница.Значение);
		
		// Запись в строку вида границы.
		ИмяВидаГраницы = Строка(Граница.ВидГраницы);
		
		ФайлXML.ЗаписатьАтрибут("type", ИмяТипа);
		ФайлXML.ЗаписатьАтрибут("valueDiv", ИмяВидаГраницы);
		
		Если ТипЗначенияГраницы <> Тип("МоментВремени") Тогда 
			ФайлXML.ЗаписатьАтрибут("value", XMLСтрока(Граница.Значение));
		Иначе
			ЗаписатьМоментВремениВXML(ФайлXML, Граница.Значение);
		КонецЕсли;
	ФайлXML.ЗаписатьКонецЭлемента();
КонецПроцедуры	

// Читает Запросы(текст и параметры) из XML-файла.
//
Функция ПрочитатьЗапросыИзФайлаXML(ДвоичныеДанные) Экспорт
	Объект = ЭтотОбъект;
	ИмяФайла = ПолучитьИмяВременногоФайла("q1c");
	ДвоичныеДанные.Записать(ИмяФайла);
	ФайлXML = Новый ЧтениеXML;
	ФайлXML.ОткрытьФайл(ИмяФайла);
	ФайлXML.Прочитать();
	//Чтение всех запросов.
	Если ФайлXML.ТипУзла = ТипУзлаXML.НачалоЭлемента и ФайлXML.Имя = "querylist" Тогда
		Пока ФайлXML.Прочитать() Цикл 
			// Чтение запроса.
			Если ФайлXML.ТипУзла = ТипУзлаXML.НачалоЭлемента и ФайлXML.Имя = "query" Тогда 
				Пока ФайлXML.ПрочитатьАтрибут() Цикл 
					Если ФайлXML.Имя = "name" тогда
						// Добавление запроса в таблицу.
						текЭлементЗапроса 				= Запросы.Добавить();
						текЭлементЗапроса.Идентификатор	= Новый УникальныйИдентификатор;
						текЭлементЗапроса.Имя 			= ФайлXML.Значение;
					КонецЕсли;	
				КонецЦикла;	
				Пока ФайлXML.Прочитать() Цикл 
					Если ФайлXML.ТипУзла = ТипУзлаXML.НачалоЭлемента и ФайлXML.Имя = "text" Тогда 
						ФайлXML.Прочитать();
						текЭлементЗапроса.Текст = ФайлXML.Значение;
					// Чтение параметров.
					КонецЕсли;
					Если ФайлXML.ТипУзла = ТипУзлаXML.НачалоЭлемента и ФайлXML.Имя = "parameters" Тогда
						Пока ФайлXML.Прочитать() цикл
							// Чтение отдельного параметра.
							Если ФайлXML.ТипУзла = ТипУзлаXML.НачалоЭлемента и ФайлXML.Имя = "parameter" Тогда
								Пока ФайлXML.ПрочитатьАтрибут() Цикл 
									// Чтение имени атрибута.									
									Если ФайлXML.Имя = "name" тогда
										текПараметрЗапроса 						= Параметры.Добавить();
										текПараметрЗапроса.Идентификатор  		= Новый УникальныйИдентификатор;
										текПараметрЗапроса.Имя					= ФайлXML.Значение;
										текПараметрЗапроса.ИдентификаторЗапроса	= текЭлементЗапроса.Идентификатор;
									КонецЕсли;
									
									// Чтение типа параметра.
									Если ФайлXML.Имя = "type" тогда
										ТипЭлемента 			= Тип(ФайлXML.Значение);
										текПараметрЗапроса.Тип	= Строка(ФайлXML.Значение);
									КонецЕсли;
									
									// Чтение значения параметра.
									Если ФайлXML.Имя = "value" тогда
										Значение					= XMLЗначение(ТипЭлемента, ФайлXML.Значение);
										текПараметрЗапроса.Значение = ЗначениеВСтрокуВнутр(Значение);
									КонецЕсли;
									
									// Чтение количества колонок Таблицы Значений.
									Если ФайлXML.Имя = "colcount" тогда
										КоличествоКолонок 	= Число(ФайлXML.Значение);
									КонецЕсли;
									
									// Чтение количества строк Таблицы Значений.
									Если ФайлXML.Имя = "rowcount" тогда
										КоличествоСтрок 	= Число(ФайлXML.Значение);
									КонецЕсли;
								КонецЦикла;
								
								// Чтение отдельных типов.
								// Для отдельных типов предусмотрено индивидуальное чтение параметров.
								// Под отдельными типами понимаются: Список значений, Таблица значений, 
								// Момент Времени, Граница.
								//
								// Список отдельных типов может увеличиваться.
								Если текПараметрЗапроса.Тип = "СписокЗначений" тогда
									ПрочитатьСписокЗначенийИзXML(ФайлXML, текПараметрЗапроса);
								КонецЕсли; 
								Если текПараметрЗапроса.Тип = "ТаблицаЗначений" тогда
									Если КоличествоКолонок > 0 Тогда 
										ПрочитатьТаблицуЗначенийИзXML(ФайлXML, текПараметрЗапроса, КоличествоСтрок, КоличествоКолонок);
									КонецЕсли;	
								КонецЕсли;
								Если текПараметрЗапроса.Тип = "МоментВремени" тогда
									ПрочитатьМоментВремениИзXML(ФайлXML, текПараметрЗапроса);
								КонецЕсли;
								Если текПараметрЗапроса.Тип = "Граница" тогда
									ПрочитатьГраницуИзXML(ФайлXML, текПараметрЗапроса);
								КонецЕсли;
							КонецЕсли;
							Если ПроверкаКонцаТэгов(ФайлXML) тогда
								Прервать;
							КонецЕсли;	
						КонецЦикла;	
					КонецЕсли;	
					Если ПроверкаКонцаТэгов(ФайлXML) тогда
						Прервать;
					КонецЕсли;
				КонецЦикла; // Обход по тэгам "query".	
			КонецЕсли; // Если "query".	
		КонецЦикла; // Обход по запросам.	
	КонецЕсли; // Если "querylist".
	ФайлXML.Закрыть();
	Возврат ЭтотОбъект;
КонецФункции

// Читает Список значений.
//
// Параметры:
//	ФайлXML - Чтение XML.
//	ПараметрЗапроса - текущий параметр.
//
Процедура ПрочитатьСписокЗначенийИзXML(ФайлXML, ПараметрЗапроса)
	СписокЗН = новый СписокЗначений;
	Пока ФайлXML.Прочитать() Цикл 
		Если ФайлXML.Имя = "item" и ФайлXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
			Пока ФайлXML.ПрочитатьАтрибут() цикл
				Если ФайлXML.Имя = "type" тогда
					ТипЭлемента = Тип(ФайлXML.Значение);
				КонецЕсли;
				Если ФайлXML.Имя = "value" тогда
					// Чтение значения.
					Значение				= XMLЗначение(ТипЭлемента, ФайлXML.Значение);
					ЗначениеЭлементаСписка 	= Значение;
				КонецЕсли;	
			КонецЦикла;	
			СписокЗН.Добавить(ЗначениеЭлементаСписка);
		ИначеЕсли ФайлXML.Имя <> "item" Тогда 
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	ПараметрЗапроса.Значение			= ЗначениеВСтрокуВнутр(СписокЗН);
КонецПроцедуры	

// Читает Таблицу значений.
//
// Параметры:
//	ФайлXML - Чтение XML.
//	ПараметрЗапроса - текущий параметр.
//	КоличествоСтрок - количество строк.
//	КоличествоКолонок - количество колонок.
//
Процедура ПрочитатьТаблицуЗначенийИзXML(ФайлXML, ПараметрЗапроса, КоличествоСтрок, КоличествоКолонок)
	ТаблицаЗначений = новый ТаблицаЗначений;
	МассивКолонок = Новый Массив;
	
	Пока ФайлXML.Прочитать() Цикл 
		Если ФайлXML.Имя = "item" и ФайлXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
			Пока ФайлXML.ПрочитатьАтрибут() цикл
				Если ФайлXML.Имя = "col" тогда
					ИндексКолонки 	= Число(ФайлXML.Значение);
				КонецЕсли;
				Если ФайлXML.Имя = "row" тогда
					ИндексСтроки 	= Число(ФайлXML.Значение);
				КонецЕсли;
				Если ФайлXML.Имя = "type" тогда
					ТипЭлемента = Тип(ФайлXML.Значение);
					МассивТипов = Новый Массив;
					МассивТипов.Добавить(ТипЭлемента);
				КонецЕсли;
				Если ФайлXML.Имя = "nameCol" тогда
					ИмяКолонки		= ФайлXML.Значение;
				КонецЕсли;
				Если ФайлXML.Имя = "value" тогда
					Значение		= XMLЗначение(ТипЭлемента, ФайлXML.Значение);
					ЗначениеЯчейки 	= Значение;
				КонецЕсли;
			КонецЦикла;	
			
			Если МассивКолонок.Количество() - 1 < ИндексКолонки тогда
				ОписаниеТипов 				= Новый ОписаниеТипов();
				ОписаниеТипов 				= Новый ОписаниеТипов(ОписаниеТипов, МассивТипов);
				
				СписокЗначенийЯчеекКолонки  = Новый СписокЗначений;
				СписокЗначенийЯчеекКолонки.Вставить(ИндексСтроки,ЗначениеЯчейки);
				
				СтруктураКолонки = Новый Структура;
				СтруктураКолонки.Вставить("Имя", ИмяКолонки);
				СтруктураКолонки.Вставить("ОписаниеТипов", ОписаниеТипов);
				СтруктураКолонки.Вставить("СписокЗначенийЯчеекКолонки", СписокЗначенийЯчеекКолонки);
				
				МассивКолонок.Вставить(ИндексКолонки,СтруктураКолонки);
			Иначе
				Имя 						= МассивКолонок.Получить(ИндексКолонки).Имя;
				ОписаниеТипов   			= МассивКолонок.Получить(ИндексКолонки).ОписаниеТипов;
				ОписаниеТипов   			= Новый ОписаниеТипов(ОписаниеТипов, МассивТипов);
				СписокЗначенийЯчеекКолонки  = МассивКолонок.Получить(ИндексКолонки).СписокЗначенийЯчеекКолонки;
				СписокЗначенийЯчеекКолонки.Вставить(ИндексСтроки,ЗначениеЯчейки);
				
				МассивКолонок.Удалить(ИндексКолонки);
				СтруктураКолонки = Новый Структура;
				СтруктураКолонки.Вставить("Имя", ИмяКолонки);
				СтруктураКолонки.Вставить("ОписаниеТипов", ОписаниеТипов);
				СтруктураКолонки.Вставить("СписокЗначенийЯчеекКолонки", СписокЗначенийЯчеекКолонки);
				МассивКолонок.Вставить(ИндексКолонки, СтруктураКолонки);
			КонецЕсли;	
		ИначеЕсли ФайлXML.Имя <> "item" Тогда 
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	КолКолонок = МассивКолонок.Количество();
	Для ИндексКолонок = 0 по КолКолонок - 1 Цикл 
		ИмяКолонки 		= МассивКолонок.Получить(ИндексКолонок).Имя;
		ТипКолонки 		= МассивКолонок.Получить(ИндексКолонок).ОписаниеТипов;
		ТаблицаЗначений.Колонки.Вставить(ИндексКолонок, ИмяКолонки, ТипКолонки, ИмяКолонки);
		
		СписокЗначений 	= МассивКолонок.Получить(ИндексКолонок).СписокЗначенийЯчеекКолонки;
		КолСтрок = СписокЗначений.Количество();
		Для ИндексСтрок = 0 по КолСтрок - 1 Цикл 
			ЗначениеЯчейки = СписокЗначений.Получить(ИндексСтрок).Значение;
			Если ИндексСтрок <= ТаблицаЗначений.Количество() - 1 Тогда 
				ТаблицаЗначений.Получить(ИндексСтрок).Установить(ИндексКолонок, ЗначениеЯчейки);
			Иначе
				ТаблицаЗначений.Вставить(ИндексСтрок).Установить(ИндексКолонок, ЗначениеЯчейки);
			КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;
	
	ПараметрЗапроса.Значение			= ЗначениеВСтрокуВнутр(ТаблицаЗначений);
КонецПроцедуры	

// Читает Момент времени.
//
// Параметры:
//	ФайлXML - Чтение XML.
//	ПараметрЗапроса - текущий параметр.
//
Процедура ПрочитатьМоментВремениИзXML(ФайлXML, ПараметрЗапроса)
	Пока ФайлXML.Прочитать() Цикл 
		Если ФайлXML.Имя = "item" и ФайлXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
			Пока ФайлXML.ПрочитатьАтрибут() цикл
				Если ФайлXML.Имя = "type" тогда
					ТипЭлемента = Тип(ФайлXML.Значение);
				КонецЕсли;
				Если ФайлXML.Имя = "valueRef" тогда
					ЗначениеСсылки	= XMLЗначение(ТипЭлемента, ФайлXML.Значение);
				КонецЕсли;
				Если ФайлXML.Имя = "valueDate" тогда
					ЗначениеДаты	= XMLЗначение(Тип("Дата"), ФайлXML.Значение);
				КонецЕсли;
			КонецЦикла;	
			МВ = новый МоментВремени(ЗначениеДаты, ЗначениеСсылки);
		ИначеЕсли ФайлXML.Имя <> "item" Тогда 
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	ПараметрЗапроса.Значение	= ЗначениеВСтрокуВнутр(МВ);
КонецПроцедуры	

// Читает Границу.
//
// Параметры:
//	ФайлXML - Чтение XML.
//	ПараметрЗапроса - текущий параметр.
//
Процедура ПрочитатьГраницуИзXML(ФайлXML, ПараметрЗапроса)
	Пока ФайлXML.Прочитать() Цикл 
		Если ФайлXML.Имя = "divide" и ФайлXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
			Пока ФайлXML.ПрочитатьАтрибут() цикл
				Если ФайлXML.Имя = "type" тогда
					ТипЭлемента = Тип(ФайлXML.Значение);
				КонецЕсли;
				Если ФайлXML.Имя = "value" тогда
					Значение	= XMLЗначение(ТипЭлемента, ФайлXML.Значение);
				КонецЕсли;
				Если ФайлXML.Имя = "valueDiv" тогда
					Вид	= XMLЗначение(Тип("Строка"), ФайлXML.Значение);
					Вид	= ОпределениеВидаГраницы(Вид);
				КонецЕсли;
			КонецЦикла;	
			Если ТипЭлемента = Тип("МоментВремени") Тогда 
				ПрочитатьМоментВремениИзXML(ФайлXML, ПараметрЗапроса);
				Значение = ЗначениеИзСтрокиВнутр(ПараметрЗапроса.Значение);
			КонецЕсли;	
			
			Граница = Новый Граница(Значение, Вид);
		ИначеЕсли ФайлXML.Имя <> "divide" Тогда 
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	ПараметрЗапроса.Значение	= ЗначениеВСтрокуВнутр(Граница);
КонецПроцедуры	

// Определяет условие конца тэга "query" или "parameters"
//
// Параметры:
//	ФайлXML - чтениеXML.
//
Функция ПроверкаКонцаТэгов(ФайлXML)
	Если (ФайлXML.ТипУзла = ТипУзлаXML.КонецЭлемента и ФайлXML.Имя = "query") 
		 или (ФайлXML.ТипУзла = ТипУзлаXML.КонецЭлемента и ФайлXML.Имя = "parameters") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции	



///////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ РАБОТЫ С ЗАПРОСОМ

// Считывает параметры из текста запроса.
//
// Параметры:
//	ТекстЗапроса - текст запроса.
//	ИдентификаторЗапроса - уникальный идентификатор запроса.
//
Функция СчитатьПараметрыЗапроса(ТекстЗапроса, ИдентификаторЗапроса) Экспорт
	МассивСтруктуры = Новый Массив;
	
	Запрос 			= Новый Запрос;
	Запрос.Текст	= ТекстЗапроса;

	// Заполняем параметрами таблицу параметров.
	ПарЗап = Запрос.НайтиПараметры();
	Для каждого СтрПараметры из ПарЗап Цикл 
		ВозврСтруктура = ДобавлениеНовогоПараметра(СтрПараметры, ИдентификаторЗапроса);
		МассивСтруктуры.Добавить(ВозврСтруктура);
	КонецЦикла;	
	
	Возврат МассивСтруктуры;
КонецФункции	

// Добавляет новый параметр в структуру параметров.
//
// Параметры:
//	ТекущийПрочитанныйПараметр - текущий параметр, прочитанный из текста запроса.
//  ИдентификаторЗапроса - GUID запроса.
//
// Возвращает: структуру параметров.
//
Функция ДобавлениеНовогоПараметра(ТекущийПрочитанныйПараметр, ИдентификаторЗапроса)
    
	ЭлементПараметр	= Новый Структура("ИдентификаторЗапроса, Имя, Тип, Значение",
        ИдентификаторЗапроса, ТекущийПрочитанныйПараметр.Имя
    );        
    
    // Смотрим на первый тип из списка, если есть.
    ДоступныеТипы = ТекущийПрочитанныйПараметр.ТипЗначения.Типы();
    Если ДоступныеТипы.Количество()=0 Тогда
        // Считаем строкой
	    ЭлементПараметр.Тип      = "Строка";
        ЭлементПараметр.Значение = ЗначениеВСтрокуВнутр("");
        Возврат ЭлементПараметр;
    КонецЕсли;
    
    // Формируем описание типа из первого доступного типа.
    Массив = Новый Массив;
    Массив.Добавить( ДоступныеТипы.Получить(0) );
	НовоеОписаниеТипов	= Новый ОписаниеТипов(Массив);
    
	Значение = НовоеОписаниеТипов.ПривестиЗначение(Неопределено);
	
	СписокДобавленныхТипов = Новый СписокЗначений;
	СформироватьСписокТипов(СписокДобавленныхТипов);
    
	Флаг = Ложь;
	СтроковоеПредставлениеТипа = Строка(ТипЗнч(Значение));
	Для каждого ЭлементСписка из СписокДобавленныхТипов Цикл 
		Если ЭлементСписка.Представление = СтроковоеПредставлениеТипа Тогда 
            Флаг = Истина;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
    ЭлементПараметр.Тип      = ?(Флаг, СтроковоеПредставлениеТипа, XMLТип(ТипЗнч(Значение)).ИмяТипа);
	ЭлементПараметр.Значение = ЗначениеВСтрокуВнутр(Значение);
	
	Возврат ЭлементПараметр;
КонецФункции

// Загружает параметры в запрос.
// Если строковое представление значения - пустая строка, тогда значение параметра является Неопределено.
//
// Параметры:
//	Запрос - передаваемый запрос.
//	ПараметрыЗапроса - передаваемые параметры для запроса.
//
Процедура ЗагрузкаПараметровВЗапрос(Запрос, ПараметрыЗапроса)
	Для каждого ЭлементПараметр из ПараметрыЗапроса Цикл 
		СтрокаЗначение = ЭлементПараметр.Значение;
		Если ПустаяСтрока(СтрокаЗначение) Тогда 
			Значение = Неопределено;
		Иначе	
			Значение = ЗначениеИзСтрокиВнутр(СтрокаЗначение);
		КонецЕсли;	
		Запрос.УстановитьПараметр(ЭлементПараметр.Имя, Значение);
	КонецЦикла;
КонецПроцедуры	

// Выполняется запрос.
//
// Параметры:
//	ТекстЗапроса - текст запроса.
//  ПараметрыЗапроса - массив параметров запроса.
//	ВыводитьВТ - выводить временные таблицы или нет.
//  ВыводитьИдентификатор - выводить GUID для ссылок или нет.
//  ПорядокОбхода - порядок обхода результата запроса.
//  ТДРезультатаЗапроса - табличный документ результата запроса.
//  ВремяВыполнения - время выполнения запроса.
//	КоличествоСтрок - Количество строк в результате запроса.
//	ТекстСообщения - текст сообщения об ошибке.
//	ИспользованиеЧередования - использовать чередование или нет в результирующем табличном документе.
//
Функция ВыполнитьЗапрос(ТекстЗапроса, ПараметрыЗапроса, ВыводитьВТ,  ВыводитьИдентификатор, ПорядокОбхода, ТДРезультатаЗапроса, ВремяВыполнения, КоличествоСтрок, ТекстСообщения, ИспользованиеЧередования) Экспорт
	
	// Массив текстов запросов.
	МассивТекстов = ПостроитьМассивТекстовЗапросов(ТекстЗапроса);
	
	Запрос 	= Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	
	// Загрузка параметров.
	ЗагрузкаПараметровВЗапрос(Запрос, ПараметрыЗапроса);
	
	// Проверка на правильность запросов.
	Попытка
		Начало = КоличествоМиллисекунд();
		МассивЗапросов = Запрос.ВыполнитьПакет();
		Конец  = КоличествоМиллисекунд();
		ВремяВыполнения = (Конец - Начало) / 1000;
	Исключение
		ТекстСообщения = ОписаниеОшибки();
		Возврат Неопределено;
	КонецПопытки;	
	
	// Вывод.
	ВывестиРезультатЗапросов(ТДРезультатаЗапроса, Запрос, МассивТекстов, МассивЗапросов, ПараметрыЗапроса, ВыводитьВТ, ВыводитьИдентификатор, ПорядокОбхода, КоличествоСтрок, ИспользованиеЧередования);
	
	Возврат МассивЗапросов;
КонецФункции	

// Возвращает массив текстов запросов.
//
// Параметры:
//	ТекстЗапроса - Текст передаваемого запроса.
//
Функция ПостроитьМассивТекстовЗапросов(знач ТекстЗапроса)
	МассивТекстов = Новый Массив;
	Пока Не ПустаяСтрока(ТекстЗапроса) цикл
		ТочкаСЗапятой = ";";
		ПозицияТочкиСЗапятой = Найти(ТекстЗапроса, ТочкаСЗапятой);
		Если ПозицияТочкиСЗапятой = 0 тогда
			ТекстОчередногоЗапроса 	= ТекстЗапроса;
			ПозицияТочкиСЗапятой	= СтрДлина(ТекстЗапроса);
		Иначе	
			ТекстОчередногоЗапроса = Лев(ТекстЗапроса, ПозицияТочкиСЗапятой - 1);
		КонецЕсли;	
		Если Не ПустаяСтрока(ТекстОчередногоЗапроса) Тогда 
			МассивТекстов.Добавить(СокрЛП(ТекстОчередногоЗапроса));
		КонецЕсли;	
		ТекстЗапроса = Сред(ТекстЗапроса, ПозицияТочкиСЗапятой + 1);
	КонецЦикла;	
	Возврат МассивТекстов;
КонецФункции	

// Возвращает есть ли в запросе иерархия.
//
// Параметры:
//	ТекстЗапроса - текст запроса.
//
Функция НаличиеИерархииВЗапросе(ТекстЗапроса)
	Итоги	= "ИТОГИ";
	Позиция	= Найти(ВРег(ТекстЗапроса), Итоги);
	
	Возврат ?(Позиция = 0, Ложь, Истина);
КонецФункции	

// Возвращает имя временной таблицы
//
// Параметры:
//	ТекстЗапроса - текст запроса.
//	Буфер - переменная хранения строки вида 'ПОМЕСТИТЬ %ИмяВременнойТаблицы%'.
//	Позиция - позиция после слова 'ПОМЕСТИТЬ' в тексте запроса.
//
Функция ПолучитьИмяВременнойТаблицы(ТекстЗапроса, Буфер, Позиция)
	ИмяТаблицы		= "";
	ДлиннаТекста 	= СтрДлина(ТекстЗапроса);
	
	// Добавление пустых символов к буферу.
	Для Индекс = Позиция по ДлиннаТекста цикл
		Символ = Сред(ТекстЗапроса, Индекс, 1);
		Если ПустаяСтрока(Символ) тогда
			Буфер = Буфер + Символ;
		Иначе
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	// Добавление имени временной таблицы.
	Для ИндексВрТабл = Индекс по ДлиннаТекста цикл
		Символ = Сред(ТекстЗапроса, ИндексВрТабл, 1);
		Если Не ПустаяСтрока(Символ) тогда
			Буфер 		= Буфер + Символ;
			ИмяТаблицы  = ИмяТаблицы + Символ; 
		Иначе
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ИмяТаблицы;
КонецФункции	

// Возвращает имя запроса из текста запроса.
//
// Параметры:
//	ТекстЗапроса - текст запроса.
//
Функция ПолучитьИмяЗапроса(знач ТекстЗапроса)
	ВозврЗнач 		= "Запрос: ";
	ДлинаТекста		= СтрДлина(ТекстЗапроса);
	ФлагПредлогаИЗ	= Истина;
	
	
	Пока ФлагПредлогаИЗ Цикл 
		СловоИЗ 	= "ИЗ";
		ДлинаИЗ 	= СтрДлина(СловоИЗ);
		ПозицияИЗ  	= Найти(ВРег(ТекстЗапроса), СловоИЗ);
		Если ПозицияИЗ = 0 тогда
			Возврат ВозврЗнач;
		КонецЕсли;
		
		СимволДоИЗ 		= Сред(ТекстЗапроса, ПозицияИЗ - 1		, 1);
		СимволПослеИЗ 	= Сред(ТекстЗапроса, ПозицияИЗ + ДлинаИЗ, 1);
		Если ПустаяСтрока(СимволДоИЗ) и ПустаяСтрока(СимволПослеИЗ) Тогда 
			ФлагПредлогаИЗ = Ложь;
		Иначе     
        	ТекстЗапроса = Сред(ТекстЗапроса, ПозицияИЗ + ДлинаИЗ);
		КонецЕсли;	
	КонецЦикла;	
	
	НачальнаяПозиция = ПозицияИЗ + ДлинаИЗ;
	
	Для Индекс = НачальнаяПозиция по ДлинаТекста Цикл 
		Символ = Сред(ТекстЗапроса, Индекс, 1);
		Если Не ПустаяСтрока(Символ) тогда
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
	// Формирование имени таблицы.
	Для ИндексЗапроса = Индекс по ДлинаТекста Цикл 
		Символ = Сред(ТекстЗапроса, ИндексЗапроса, 1);
		Если Не ПустаяСтрока(Символ) тогда
			ВозврЗнач = ВозврЗнач + Символ;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВозврЗнач;
КонецФункции	



///////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ РАБОТЫ С РЕЗУЛЬТАТОМ ЗАПРОСА

// Вывод результата всех запросов с временными таблицами.
// 
// Если временная таблица, то выполняется запрос из массива текстов и формируется результат.
// Если не временная таблица, то результат берется из МассиваРезультатов.
//
// Параметры:
//	ТДРезультатаЗапроса - табличный документ результата запроса.
//	Запрос - передаваемый запрос.
//	МассивТекстов - массив текстов запросов.
//	МассивЗапросов - массив результатов запросов.
//	ПараметрыЗапроса - массив параметров запросов.
//	ВыводитьВТ - выводить или нет временные таблицы.
//	ВыводитьИдентификатор - выводить или нет значения ссылок.
//  ПорядокОбхода - порядок обхода в результате запроса.
//  КоличествоСтрок - общее количество строк.
//	ИспользованиеЧередования - использование чередования цвета строк в табличном документе.
//
Функция ВывестиРезультатЗапросов(ТДРезультатаЗапроса, Запрос, МассивТекстов, МассивЗапросов, ПараметрыЗапроса, ВыводитьВТ, ВыводитьИдентификатор, ПорядокОбхода, КоличествоСтрок, ИспользованиеЧередования)
	КоличествоТекстовЗапросов 		= МассивТекстов.Количество();
	КоличествоРезультатовЗапросов   = МассивЗапросов.Количество();
		
	Если КоличествоРезультатовЗапросов <> КоличествоТекстовЗапросов тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	// Накапливаемый запрос необходим для вывода временных таблиц, в том числе и удаляемых.
	НакапливаемыйЗапрос = Новый Запрос;
	ЗагрузкаПараметровВЗапрос(НакапливаемыйЗапрос, ПараметрыЗапроса);
	
	Для Индекс = 0 по КоличествоТекстовЗапросов - 1 цикл
		КоличествоСтрокОдногоЗапроса			= 0;
		МассивШириныКолонок 								= Новый массив;
		Свертка 								= ОпределитьСвертку(Индекс, КоличествоРезультатовЗапросов);
		ТекстЗапросаМассива 					= МассивТекстов.Получить(Индекс);
		
		Поместить 			= "ПОМЕСТИТЬ";
		ДлинаПоместить		= СтрДлина(Поместить);		
		ПозицияПоместить 	= Найти(ВРег(ТекстЗапросаМассива), Поместить);
		
		Если Индекс = 0 тогда
			СимволРазделенияЗапросов = "";
		Иначе	
			СимволРазделенияЗапросов = ";";
		КонецЕсли;
		НакапливаемыйЗапрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		НакопленныйТекст		  = НакапливаемыйЗапрос.Текст + СимволРазделенияЗапросов + МассивТекстов.Получить(Индекс);
		НакапливаемыйЗапрос.Текст = НакопленныйТекст;

		
		Если ПозицияПоместить <> 0 и ВыводитьВТ Тогда // Если временная таблица и выводить временные таблицы.
			БуферПоместить			 = Сред(ТекстЗапросаМассива, ПозицияПоместить, ДлинаПоместить);
			ПозицияПослеПоместить 	 = ПозицияПоместить + ДлинаПоместить;
			ИмяТаблицы 	= ПолучитьИмяВременнойТаблицы(ТекстЗапросаМассива, БуферПоместить, ПозицияПослеПоместить);
			
			// Выполнение запроса.
			ИмяЗапроса = "";
			Результат = ВыполнитьЗапросСВременнойТаблицей(НакапливаемыйЗапрос, ИмяТаблицы, ИмяЗапроса);
			
			Если Результат <> Неопределено Тогда 
				ТД = ВывестиРезультатОдногоЗапроса(ИмяЗапроса, Результат, Свертка, ВыводитьИдентификатор, ПорядокОбхода, Ложь, КоличествоСтрокОдногоЗапроса, МассивШириныКолонок, ИспользованиеЧередования);
				ТДРезультатаЗапроса.Вывести(ТД);
			КонецЕсли;	
		ИначеЕсли ПозицияПоместить = 0 Тогда // Если таблица не временная, то используется готовый результат.
			Результат  	= МассивЗапросов.Получить(Индекс);
			ИмяЗапроса 	= ПолучитьИмяЗапроса(ТекстЗапросаМассива);
			Иерархия   	= НаличиеИерархииВЗапросе(ТекстЗапросаМассива);
			
			ТД = ВывестиРезультатОдногоЗапроса(ИмяЗапроса, Результат, Свертка, ВыводитьИдентификатор, ПорядокОбхода, Иерархия, КоличествоСтрокОдногоЗапроса, МассивШириныКолонок, ИспользованиеЧередования);
			ТДРезультатаЗапроса.Вывести(ТД);
		КонецЕсли;	
		КоличествоСтрок = КоличествоСтрок + КоличествоСтрокОдногоЗапроса;
	КонецЦикла;
КонецФункции

// Вывод результат запроса в табличный документ.
//
// Параметры:
//	ИмяЗапроса - имя запроса.
//	РезЗапроса - результат запроса.
//	Открыта - свернуть результат одного запроса в выводимом табличном документе.
//	ВыводитьИдентификатор - выводить или нет значение ссылки.
//	ПорядокОбхода - порядок обхода результата.
//  Иерархия - наличие итогов в запросе.
//	КоличествоСтрок - Количество строк в результате данного запроса.
//	МассивШириныКолонок - массив максимальной ширины каждой колонки.
//	ИспользованиеЧередования - использование чередования цветом.
//
Функция ВывестиРезультатОдногоЗапроса(ИмяЗапроса, РезЗапроса, Открыта, ВыводитьИдентификатор, ПорядокОбхода, Иерархия, КоличествоСтрок, МассивШириныКолонок, ИспользованиеЧередования)
	РезЗапроса 	  = ВыгрузкаРезультата(РезЗапроса, ПорядокОбхода, Иерархия);
	
	ВыходнойМакет 			= Новый ТабличныйДокумент;
	МакетОдногоЗапроса    	= Новый ТабличныйДокумент;
	
	Если РезЗапроса = Неопределено Тогда 
		Возврат ВыходнойМакет;
	КонецЕсли;	
	
	МакетОдногоЗапроса.Очистить();
	ВыходнойМакет.Очистить();
	
	УровеньВерхний				= 1;
	УровеньЗаголовкаИДеталей 	= 2;
		
	// Вывод в табличный документ.
	ЗаголовкиКолонок 	= ВывестиЗаголовкиКолонок(РезЗапроса, МассивШириныКолонок);
	Детали				= ВывестиДетали(РезЗапроса, ВыводитьИдентификатор, КоличествоСтрок, МассивШириныКолонок, ИспользованиеЧередования);
	Заголовок			= ВывестиЗаголовокЗапроса(ИмяЗапроса, КоличествоСтрок);
	
	МакетОдногоЗапроса.НачатьАвтогруппировкуСтрок();
	
	МакетОдногоЗапроса.Вывести(Заголовок, УровеньВерхний);
	МакетОдногоЗапроса.Вывести(ЗаголовкиКолонок, УровеньЗаголовкаИДеталей, , Открыта);
	МакетОдногоЗапроса.Вывести(Детали, УровеньЗаголовкаИДеталей, , Открыта);
	
	МакетОдногоЗапроса.ЗакончитьАвтогруппировкуСтрок();
	
	УстановкаАвтоШирины(ВыходнойМакет, МассивШириныКолонок);
	ВыходнойМакет.Вывести(МакетОдногоЗапроса).СоздатьФорматСтрок();
	
	Возврат ВыходнойМакет;
КонецФункции

// Возвращает ТаблицуЗначений или ДеревоЗначений результата.
//
// Параметры:
//	РезультатЗапроса - результат запроса.
//  Иерархия - есть ли иерархия в запросе. 
//
Функция ВыгрузкаРезультата(РезультатЗапроса, ПорядокОбхода, Иерархия)
	
	Если РезультатЗапроса = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;	
	
	Если ВРег(ПорядокОбхода) = "АВТО" Тогда 
		Если Иерархия тогда
			ВыгруженноеЗначение = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Иначе
			ВыгруженноеЗначение = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.Прямой);
		КонецЕсли;
	Иначе
		ВыгруженноеЗначение = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.Прямой);
	КонецЕсли;	
	
	Возврат ВыгруженноеЗначение;
	
КонецФункции	

Функция ВывестиЗаголовокЗапроса(ИмяЗапроса,КоличествоСтрок)
	Заголовок 	= Новый ТабличныйДокумент;
	
	МакетВывода = ПолучитьМакет("РезультатВыполненияЗапроса");
	
	ОбластьЗаголовок 	= МакетВывода.ПолучитьОбласть("ЗапросИмя");
	ОбластьЗаголовок.Параметры.ИмяЗапроса  		= ИмяЗапроса;
	ОбластьЗаголовок.Параметры.КоличествоСтрок	= КоличествоСтрок;
	Заголовок.Вывести(ОбластьЗаголовок);
	
	Возврат Заголовок;
КонецФункции

Функция ВывестиЗаголовкиКолонок(Результат, МассивШириныКолонок)
	МакетВывода 				= ПолучитьМакет("РезультатВыполненияЗапроса");
	
	ВерхнийЗаголовокКолонок		= Новый ТабличныйДокумент;
	
	ЗаголовокКолонок				= Новый ТабличныйДокумент;
	ОбластьЗаголовкиКолонок 	= МакетВывода.ПолучитьОбласть("ОбластьЯчейки");
	
	Область 	  					= ОбластьЗаголовкиКолонок.Область();
	Область.Шрифт 					= Новый Шрифт(,, Ложь);
	Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	Область.ЦветФона				= Новый Цвет(204, 192, 133);
	
	Индекс = 0;
	// Вывод заголовка таблицы.
	Для каждого Стр из Результат.Колонки цикл
		УстановкаМаксимальнойШириныВМассив(Индекс, Стр.Имя, МассивШириныКолонок);
		ОбластьЗаголовкиКолонок.Параметры.Значение	= Стр.Имя;
		Об = ЗаголовокКолонок.Присоединить(ОбластьЗаголовкиКолонок);
		Об.ШиринаКолонки = МассивШириныКолонок.Получить(Индекс);
		Индекс	= Индекс + 1;
	КонецЦикла;                          
	ВерхнийЗаголовокКолонок.Вывести(ЗаголовокКолонок);
	
	Возврат ВерхнийЗаголовокКолонок;
КонецФункции

Функция ВывестиДетали(Результат, ВыводитьИдентификатор, КоличествоСтрок, МассивШириныКолонок, ИспользованиеЧередования)
	Детали = Новый ТабличныйДокумент;
	Уровень = 1;
	Детали.НачатьАвтогруппировкуСтрок();
	
	Если ТипЗнч(Результат) = Тип("ДеревоЗначений") тогда
		ИндексСтроки 		= 1;
		КоличествоКолонок 	= Результат.Колонки.Количество();
		ВывестиДеталиСИерархией(Детали, Результат, ВыводитьИдентификатор, Уровень, КоличествоКолонок, КоличествоСтрок, ИндексСтроки, МассивШириныКолонок, ИспользованиеЧередования);
	КонецЕсли;
	Если ТипЗнч(Результат) = Тип("ТаблицаЗначений") тогда
		КоличествоКолонок 	= Результат.Колонки.Количество();
		ВывестиДеталиБезИерархии(Детали, Результат, ВыводитьИдентификатор, Уровень, КоличествоКолонок, КоличествоСтрок, МассивШириныКолонок, ИспользованиеЧередования);
	КонецЕсли;
	
	Детали.ЗакончитьАвтогруппировкуСтрок();
	Возврат Детали;
КонецФункции

Функция ВывестиДеталиБезИерархии(ОбщиеДетали, Результат, ВыводитьИдентификатор, Уровень, КоличествоКолонок, КоличествоСтрок, МассивШириныКолонок, ИспользованиеЧередования)
	МакетВывода 				= ПолучитьМакет("РезультатВыполненияЗапроса");
	КоличествоСтрок = Результат.Количество();
	ИндексСтроки = 1;
	Для каждого Строка из Результат Цикл
		Детали			= Новый ТабличныйДокумент;
		ОбластьДетали 	= МакетВывода.ПолучитьОбласть("ОбластьЯчейки");
		
		Область 			= ОбластьДетали.ТекущаяОбласть;
		Область.Шрифт 		= Новый Шрифт(,, Ложь);
		Область.ЦветФона	= ОпределитьЦветФонаПоИндексу(ИндексСтроки, ИспользованиеЧередования);

		Для Индекс = 0 по КоличествоКолонок - 1 Цикл 
			Значение 				= Строка.Получить(Индекс);
			ЗначениеДляПараметра 	= Значение;
			Если ЭтоСсылка(ТипЗнч(Значение)) и ВыводитьИдентификатор Тогда 
				Попытка
					ЗначениеДляПараметра = Значение.УникальныйИдентификатор();
				Исключение
					ЗначениеДляПараметра = Значение;
				КонецПопытки;
			КонецЕсли;	
			ОбластьДетали.Параметры.Значение 	= ЗначениеДляПараметра;
			ОбластьДетали.Параметры.Расшифровка = Значение;
			УстановкаМаксимальнойШириныВМассив(Индекс, ЗначениеДляПараметра, МассивШириныКолонок);
        	Детали.Присоединить(ОбластьДетали);
		КонецЦикла;	
		ИндексСтроки = ИндексСтроки + 1;
		ОбщиеДетали.Вывести(Детали, Уровень);
	КонецЦикла;	
КонецФункции

Функция ВывестиДеталиСИерархией(ОбщиеДетали, Результат, ВыводитьИдентификатор, Уровень, КоличествоКолонок, КоличествоСтрок, ИндексСтроки, МассивШириныКолонок, ИспользованиеЧередования)
	МакетВывода 				= ПолучитьМакет("РезультатВыполненияЗапроса");
	Открыта = Истина;
	Подчиненные = Результат.Строки;
	КоличествоСтрок = КоличествоСтрок + Подчиненные.Количество();
	Для Каждого Подчиненный Из Подчиненные Цикл
		Детали			= Новый ТабличныйДокумент;
		ОбластьДетали 	= МакетВывода.ПолучитьОбласть("ОбластьЯчейки");
		
		Область 			= ОбластьДетали.ТекущаяОбласть;
		Область.Шрифт 		= Новый Шрифт(,, Ложь);
		Область.ЦветФона	= ОпределитьЦветФонаПоИндексу(ИндексСтроки, ИспользованиеЧередования);
		
		Для Индекс = 0 по КоличествоКолонок - 1 Цикл 
			Значение 				= Подчиненный.Получить(Индекс);
			ЗначениеДляПараметра 	= Значение;
			// Определение количество отступа по уровню.
            Пробел 	= ОпределениеОтступаПоУровню(Уровень, Индекс, Открыта);
			
			Если ЭтоСсылка(ТипЗнч(Значение)) и ВыводитьИдентификатор Тогда
				Попытка
					ЗначениеДляПараметра = Значение.УникальныйИдентификатор();
				Исключение
					ЗначениеДляПараметра = Значение;
				КонецПопытки;
			КонецЕсли;	
			ЗначениеДляПараметра			 	= "" + Пробел + ЗначениеДляПараметра;
			ОбластьДетали.Параметры.Значение 	= ЗначениеДляПараметра;
			ОбластьДетали.Параметры.Расшифровка = Значение;
			
			УстановкаМаксимальнойШириныВМассив(Индекс, ЗначениеДляПараметра, МассивШириныКолонок);
			
			Детали.Присоединить(ОбластьДетали);
		КонецЦикла;	
		
		ОбщиеДетали.Вывести(Детали, Уровень,, Открыта);
		ИндексСтроки = ИндексСтроки + 1;
		ВывестиДеталиСИерархией(ОбщиеДетали, Подчиненный, ВыводитьИдентификатор, Уровень + 1, КоличествоКолонок, КоличествоСтрок, ИндексСтроки, МассивШириныКолонок, ИспользованиеЧередования);
	КонецЦикла;
КонецФункции

// Определяет сворачивать или нет результат одного запроса.
//
// Параметры:
//	ПозицияТекущегоЗапроса - порядок запроса в пакете.
//	КоличествоВсехЗапросов - количество всех запросов в пакете.
//
Функция ОпределитьСвертку(знач ПозицияТекущегоЗапроса, КоличествоВсехЗапросов)
	ПозицияТекущегоЗапроса = ПозицияТекущегоЗапроса + 1;
	
	Если КоличествоВсехЗапросов = 1 Тогда 
		ВозврЗнач = Истина;
	Иначе
		Если ПозицияТекущегоЗапроса = КоличествоВсехЗапросов Тогда 
			ВозврЗнач = Истина;
		Иначе
			ВозврЗнач = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВозврЗнач;
КонецФункции	

// Выводит строку с автошириной колонок.
//
// Параметры: 
//	РезЗапроса - табличный документ с результатом запроса.
//	МассивМаксШирины - массив ширины колонок для отдельного запроса.
//
Процедура УстановкаАвтоШирины(РезЗапроса, МассивМаксШирины)
	ВерхняяГраница = МассивМаксШирины.ВГраница();
	Если ВерхняяГраница = -1 Тогда 
		Возврат;
	КонецЕсли;
	
	Для Индекс = 0 по ВерхняяГраница Цикл 
		ВрТаблД = Новый ТабличныйДокумент;
		Стр = ВрТаблД.ПолучитьОбласть(1, Индекс + 1, 1, Индекс + 1);
		РезЗапроса.Присоединить(Стр).ШиринаКолонки = МассивМаксШирины.Получить(Индекс);
	КонецЦикла;	
КонецПроцедуры	


///////////////////////////////////////////////////////////////////////////
// ПРОЧИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает время в миллисекундах или секундах.
//
Функция КоличествоМиллисекунд()
	Попытка
		Script = Новый COMОбъект("MSScriptControl.ScriptControl");
		Script.Language = "javascript";
		Script.Timeout	= -1;
		Время = Script.Eval("var d = new Date(); d.getTime()");
	Исключение
		Время = ТекущаяДата();
	КонецПопытки;	
	
	Возврат Время;
КонецФункции	

// Формирует список возможных типов конфигурации.
//
// Параметры:
//	СписокДобавленныхТипов - список типов, добавленных "вручную".
//
Функция СформироватьСписокТипов(СписокДобавленныхТипов = Неопределено) Экспорт
	МассивТипов = ДоступныеТипыДанных.Типы();
	
	НеПримитивныеТипы = Новый СписокЗначений;
	НеПримитивныеТипы.ЗагрузитьЗначения(МассивТипов);
	НеПримитивныеТипы.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	
	СписокТипов = Новый СписокЗначений;
	СписокТипов.Добавить("Строка", "Строка");
	СписокТипов.Добавить("Число", "Число");
	СписокТипов.Добавить("Дата", "Дата");
	СписокТипов.Добавить("Булево", "Булево");
	СписокТипов.Добавить("Граница", "Граница");
	СписокТипов.Добавить("МоментВремени", "Момент времени");
	СписокТипов.Добавить("СписокЗначений", "Список значений");
	СписокТипов.Добавить("ТаблицаЗначений", "Таблица значений");
	
	СписокДобавленныхТипов = Новый СписокЗначений;
	СписокДобавленныхТипов = СписокТипов.Скопировать();
	
	Для каждого Стр из НеПримитивныеТипы Цикл
		ЗначениеТипа 		= XMLТип(Стр.Значение).ИмяТипа;
		ПредставлениеТипа 	= Строка(Стр.Значение);
		СписокТипов.Добавить(ЗначениеТипа, ПредставлениеТипа);
	КонецЦикла;
	
	Возврат СписокТипов;
КонецФункции	

// Определяет отступ по уровню.
//
// Параметры
//	Уровень - переданный уровень в дереве.
//	НомерКолонки - номер колонки, отступ устанавливается только для первой колонки.
//	Открыта - открыта группа или нет.
//
Функция ОпределениеОтступаПоУровню(Уровень, НомерКолонки, Открыта)
	Пробел = "";
	Если НомерКолонки = 0 Тогда 
		Если Уровень > 1 Тогда 
			Для Индекс = 1 по Уровень цикл
				Пробел = Пробел + Символы.Таб; 
			КонецЦикла;
			Открыта = Ложь;
		Иначе
			Открыта = Истина;
		КонецЕсли;	
	КонецЕсли;	
	Возврат Пробел;
КонецФункции	

// Возвращает строковое представление типа по значению.
//
// Параметры:
//	Значение - передаваемое значение.
//
Функция ИмяТипаИзЗначения(Значение) Экспорт
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		ИмяТипа = "Строка";
	ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда 	
		ИмяТипа = "Число";
	ИначеЕсли ТипЗнч(Значение) = Тип("Булево") Тогда 	
		ИмяТипа = "Булево";
	ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда 		
		ИмяТипа = "Дата";
	ИначеЕсли ТипЗнч(Значение) = Тип("МоментВремени") Тогда 		
		ИмяТипа = "МоментВремени";	
	ИначеЕсли ТипЗнч(Значение) = Тип("Неопределено") Тогда 		
		ИмяТипа = "Строка";		
	Иначе	
		ИмяТипа = xmlТип(ТипЗнч(Значение)).ИмяТипа;
	КонецЕсли;	
	
	Возврат ИмяТипа;
КонецФункции	

// Возвращает вид границы из ее строкового представления.
//
// Параметры:
//	Вид - строковое представление вида границы.
//
Функция ОпределениеВидаГраницы(Вид) Экспорт
	Если ВРег(Вид) = "ИСКЛЮЧАЯ" тогда
		ВозврЗнач = ВидГраницы.Исключая;
	Иначе
		ВозврЗнач = ВидГраницы.Включая;
	КонецЕсли;	
	
	Возврат ВозврЗнач;
КонецФункции	

// Возвращает представление значения.
//
// Параметры:
//	Значение - передаваемое значение.
//
Функция ФормированиеПредставленияЗначения(Значение) Экспорт
	ВозврЗнач = "";
	
	Если ТипЗнч(Значение) = Тип("ТаблицаЗначений") Тогда 
		ВыводнаяСтрока = "Таблица: строк = %КоличествоСтрок%, колонок = %КоличествоКолонок%";
		ВыводнаяСтрока = СтрЗаменить(ВыводнаяСтрока, "%КоличествоСтрок%", Строка(Значение.Количество()));
		ВыводнаяСтрока = СтрЗаменить(ВыводнаяСтрока, "%КоличествоКолонок%", Строка(Значение.Колонки.Количество()));
		ВозврЗнач = ВыводнаяСтрока;
	ИначеЕсли ТипЗнч(Значение) = Тип("МоментВремени") Тогда 
		ВозврЗнач = Строка(Значение.Дата) + "; " + Строка(Значение.Ссылка);
	ИначеЕсли ТипЗнч(Значение) = Тип("Граница") Тогда 
		ВозврЗнач = Строка(Значение.Значение) + "; " + Строка(Значение.ВидГраницы);
	КонецЕсли;	
	
	Возврат ВозврЗнач;
КонецФункции	

// Фильтрует список типов для данного контекста.
//
// Параметры:
//	СписокТипов - список значений передаваемых типов.
//  Контекст - передаваемый контекст в виде строки.
//
Процедура ФильтрацияСпискаТипов(СписокТипов, Контекст) Экспорт
	Если нРег(Контекст) = "граница" Тогда 
		Элемент = СписокТипов.НайтиПоЗначению("СписокЗначений");
		СписокТипов.Удалить(Элемент);
		Элемент = СписокТипов.НайтиПоЗначению("ТаблицаЗначений");
		СписокТипов.Удалить(Элемент);
		Элемент = СписокТипов.НайтиПоЗначению("Граница");
		СписокТипов.Удалить(Элемент);
	КонецЕсли;
	
	Элемент = СписокТипов.НайтиПоЗначению("TypeDescription"); // Тип "Описание типов" удаляется всегда.
	СписокТипов.Удалить(Элемент);
КонецПроцедуры	

// Устанавливает максимальную ширину ячейки для каждой колонки
//
Процедура УстановкаМаксимальнойШириныВМассив(Индекс, знач Элем, МассивШириныКолонок)
	МаксимальнаяШиринаЯчейки    = 100;
	
	Элем = СокрП(Элем);
	Элем = СтрДлина(Элем);
	Если Индекс > МассивШириныКолонок.ВГраница() Тогда
		Если Элем < МаксимальнаяШиринаЯчейки Тогда 
			МассивШириныКолонок.Вставить(Индекс, Элем + 1);
		Иначе
			МассивШириныКолонок.Вставить(Индекс, МаксимальнаяШиринаЯчейки);
		КонецЕсли;	
	Иначе
		Макс = МассивШириныКолонок.Получить(Индекс);
		Если Элем > Макс Тогда
			Если Элем < МаксимальнаяШиринаЯчейки Тогда
				МассивШириныКолонок.Установить(Индекс, Элем + 1);
			Иначе
				МассивШириныКолонок.Установить(Индекс, МаксимальнаяШиринаЯчейки);
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры	

// Проверяет является ли тип ссылкой.
//
// Параметры:
//	Тип - передаваемый тип.
//
Функция ЭтоСсылка(Тип) Экспорт
	
	Возврат Справочники.ТипВсеСсылки().СодержитТип(Тип)
		ИЛИ Документы.ТипВсеСсылки().СодержитТип(Тип)
		ИЛИ Перечисления.ТипВсеСсылки().СодержитТип(Тип)
		ИЛИ ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(Тип)
		ИЛИ ПланыСчетов.ТипВсеСсылки().СодержитТип(Тип)
		ИЛИ ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(Тип)
		ИЛИ БизнесПроцессы.ТипВсеСсылки().СодержитТип(Тип)
		ИЛИ БизнесПроцессы.ТипВсеСсылкиТочекМаршрутаБизнесПроцессов().СодержитТип(Тип)
		ИЛИ Задачи.ТипВсеСсылки().СодержитТип(Тип)
		ИЛИ ПланыОбмена.ТипВсеСсылки().СодержитТип(Тип);
	
КонецФункции

// Возвращает результат выполнения временной таблицы по имени.
//
// Параметры:
//	Запрос - передаваемый запрос.
//	ИмяВременнойТаблицы - имя временной таблицы.
//  ИмяЗапроса - имя запроса, изменяемое в теле процедуры.
//
Функция ВыполнитьЗапросСВременнойТаблицей(знач ЗапросДляВыполнения, ИмяВременнойТаблицы, ИмяЗапроса)
	ЗапросДляВыполнения.Текст = ЗапросДляВыполнения.Текст + " ; " + "Выбрать * ИЗ " + ИмяВременнойТаблицы;
	Попытка
		Результат 	= ЗапросДляВыполнения.Выполнить();
		ИмяЗапроса 	= "Временная таблица: " + ИмяВременнойТаблицы;
	Исключение
		Результат = Неопределено;
	КонецПопытки;	
	
	Возврат Результат;
КонецФункции	

// Возвращает цвет фона табличного документа по индексу строки и по использованию.
//
// Параметры:
//	Индекс - передаваемый индекс строки.
//	Использование - использовать или нет чередование.
//
Функция ОпределитьЦветФонаПоИндексу(Индекс, Использование)
	ЦветЧередования	= Новый Цвет(245, 242, 221);
	
	Если Не Использование Тогда
		Возврат Webцвета.Белый;
	КонецЕсли;	
	
	Остаток = Индекс % 2;
	Если Остаток = 0 Тогда
		Цвет = ЦветЧередования;
	Иначе
		Цвет = WebЦвета.Белый;
	КонецЕсли;	
	
	Возврат Цвет;
КонецФункции
